Revit 2026 API

# SpanDirectionSymbolFailures Properties

---

The BuiltInFailuresSpanDirectionSymbolFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NonPlanView | Span Direction Symbol can only be placed in a Floor Plan View. |

#### Reference

BuiltInFailuresSpanDirectionSymbolFailures Class

Autodesk.Revit.DB Namespace